ERP.belugaerp/src/InformationRegisters/СтатусыДокументовЕГАИС/СтатусыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>бг_АктОбУничтоженииФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ДобавлениеНовойПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияАктаОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияПланируемогоВвоза</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_КвитанцияОтчетОбИспользованииФСМ</name>
    <comment>ReportUsingFSM</comment>
  </enumValues>
  <enumValues>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтветНаЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОбИмпортеПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОПроизводствеЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ПланируемыйВвозЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ТТНИсходящаяЕГАИС/ТТНИсходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНИсходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаФиксацииЕГАИС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерФиксацииЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Покупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/бг_ТТНИсходящаяЕГАИСИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Обход ситуации с реквизитом документа "Идентификатор" (особое свойство адаптера).
	СтрокиСРеквизитом = РеквизитыИСвойства.Реквизиты.НайтиСтроки(Новый Структура("ИмяСвойстваXDTO", "Идентификатор"));
	Для каждого СтрокаРеквизита Из СтрокиСРеквизитом Цикл
		СтрокаРеквизита.ИмяСвойстваXDTO = "";
	КонецЦикла;
	
	адаптер_НастройкиОбмена.УдалитьРеквизит(РеквизитыИСвойства, , "ДанныеПроверкиИПодбора");
	адаптер_НастройкиОбмена.УдалитьРеквизит(РеквизитыИСвойства, , "ДанныеПроверкиИПодбораАктРасхождений");
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства);
КонецПроцедуры	

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт

	// Реквизит Идентификатор заменить на бг_Идентификатор, т.к. предопределенное свойство адаптера.
	ТекстПоиска = "NULL КАК бг_Идентификатор,";
	ТекстЗамены = "ВыгружаемыйОбъект.Идентификатор КАК бг_Идентификатор,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
	// Добавить условие на заполненность идентификатора ЕГАИС.
	ТекстПоиска = "&УсловиеЗапроса";
	
	ТекстЗамены = 
	"&УсловиеЗапроса
	| И ВыгружаемыйОбъект.ИдентификаторЕГАИС <> """"";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
	// Упорядочим выгружаемые товары по номеру строки, т.к. на основе этого порядка выполняется связь с марками.
	ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ВыгружаемыйОбъект.Товары.НомерСтроки";
	
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_обработчикиСобытийСтандартный;
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(
		Объект,
		ДанныеСообщения);
	
	Если ДанныеОбъекта.Реквизиты.Количество() > 0 Тогда
		
		РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
		
		РеквизитыОбъекта.Вставить("бг_ЕстьДвиженияЕГАИС", бг_ТТНВходящаяЕГАИСИнтеграция.ЕстьДвиженияЕАГИС(Объект));
		РеквизитыОбъекта.Вставить("бг_ОтмененВЕГАИС", ТТНИсходящаяОтмененаВЕГАИС(Объект));
		РеквизитыОбъекта.Вставить("СтатусТТН", СтатусТТН(Объект));	
		
		Операции = Новый Массив;
		Операции.Добавить(Перечисления.ВидыДокументовЕГАИС.УведомлениеОРегистрацииДвиженияТТН);	
		ДанныеЗапросаЕГАИС = бг_ТТНВходящаяЕГАИСИнтеграция.ДанныеЗапросаЕГАИС(Объект, Операции);
		
		ИдентификаторЗапросаАкта = "";
		ДатаЗапросаАкта = Дата(1, 1, 1);
		Если ДанныеЗапросаЕГАИС <> Неопределено Тогда
			ИдентификаторЗапросаАкта = ДанныеЗапросаЕГАИС.ИдентификаторЗапроса;
			ДатаЗапросаАкта = ДанныеЗапросаЕГАИС.ДатаСозданияЗапроса;
		КонецЕсли;
		РеквизитыОбъекта.Вставить("ИдентификаторЗапросаАкта", ИдентификаторЗапросаАкта);
		РеквизитыОбъекта.Вставить("ДатаЗапросаАкта", ДатаЗапросаАкта);
			
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ДокументОснование");
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ДанныеМарокУпаковок = ДанныеМарокУпаковок(Объект, ДокументОснование);
			
			Если ДанныеМарокУпаковок <> Неопределено Тогда
				бг_МаркируемаяПродукция.ДобавитьДанныеОбАкцизныхМаркахВРеквизитыСообщения(
					РеквизитыОбъекта, Объект, ДанныеМарокУпаковок);
			КонецЕсли;
			
			ЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ЗаказКлиента");
			
			Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") 
				И ЗначениеЗаполнено(ЗаказКлиента) Тогда 
				
				ДатаОплаты = бг_ЗаказКлиентаИнтеграция.МаксимальнаяДатаОплатыПоЗаказуКлиента(ЗаказКлиента);
				
				Если ДатаОплаты <> Неопределено Тогда
					РеквизитыОбъекта.Вставить("ДатаОплаты", ДатаОплаты);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
		
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ВыполненыУсловияВыгрузкиОбъекта(ДанныеСообщения) Экспорт
	
	Результат = Истина;
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Объект, "ДокументОснование");
	Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "бг_ЗагруженИзУПП") Тогда
			ТекстОшибки = НСтр("ru = 'Документ загружен из УПП'"); 
			ДанныеСообщения.ТекстОшибки = ТекстОшибки;
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
#Область Шапка	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"ИдентификаторЗапросаАкта",
		ОбщегоНазначения.ОписаниеТипаСтрока(36));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства, 
		РеквизитыИСвойства.МетаданныеОбъекта, 
		,
		"ДатаЗапросаАкта", 
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_ЕстьДвиженияЕГАИС",
		Новый ОписаниеТипов("Булево"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_Идентификатор",
		ОбщегоНазначения.ОписаниеТипаСтрока(50));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_ОтмененВЕГАИС",
		Новый ОписаниеТипов("Булево"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		"ДокументОснование", // ИмяРеквизита
		,
		Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_ВариантВыгрузкиМарокУпаковок",
		ОбщегоНазначения.ОписаниеТипаСтрока(25));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_ИмяФайлаВыгрузкиМарокУпаковок",
		ОбщегоНазначения.ОписаниеТипаСтрока(0));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта, 
		,
		"СтатусТТН", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыОбработкиТТНИсходящейЕГАИС"));
		
#КонецОбласти // Конец Шапка

#Область АкцизныеМарки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"АкцизныеМарки.КодАкцизнойМарки",
		Метаданные.РегистрыСведений.бг_ИдентификаторыМарок.Ресурсы.ИдентификаторМарки.Тип);
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"АкцизныеМарки.НомерКоробки",
		Метаданные.РегистрыСведений.бг_ДвижениеМарок.Ресурсы.КодУпаковки.Тип);
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"АкцизныеМарки.КлючСвязи",
		ОбщегоНазначения.ОписаниеТипаЧисло(5));
#КонецОбласти // Конец Марки

#Область Упаковки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"Упаковки.Упаковка",
		Метаданные.РегистрыСведений.бг_СоставУпаковок.Измерения.КодУпаковки.Тип);

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"Упаковки.ИерархияУпаковки",
		Метаданные.РегистрыСведений.бг_СоставУпаковок.Ресурсы.КодВышестоящейУпаковки.Тип);
#КонецОбласти // Конец Упаковки

КонецПроцедуры

Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
			
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.РеализацияТоваровУслуг,
		"ЗаказКлиента",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));		

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ЗаказКлиента,
		"бг_ГУИДЗаказаСПортала",
		"бг_ГУИДЗаказаСПортала", // МетаданныеОбъекта
		ОбщегоНазначения.ОписаниеТипаСтрока(36));		
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ЗаказКлиента,
		,
		"ДатаОплаты", // МетаданныеОбъекта
		Новый ОписаниеТипов("Дата"));				
 		
КонецПроцедуры

Функция ДанныеМарокУпаковок(ТТНИсходящаяЕГАИС, РеализацияТоваровУслуг)

	ДанныеОтгружаемыхШтрихкодовТТН = Документы.ТТНИсходящаяЕГАИС.бг_ДанныеОтгружаемыхШтрихкодов(
		ТТНИсходящаяЕГАИС,
		РеализацияТоваровУслуг,
		Ложь);
		
	Если ДанныеОтгружаемыхШтрихкодовТТН = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	МаркиСоответствуютАлкогольнойПродукцииТТН = Документы.ТТНИсходящаяЕГАИС.бг_МаркиСоответствуютАлкогольнойПродукцииТТН(
		ДанныеОтгружаемыхШтрихкодовТТН.Марки,
		ТТНИсходящаяЕГАИС);
		
	// Если состав марок не соответствует алкогольной продукции ТТН, то такая ТТН некорректная,
	// выгружать ее без исправления ошибки не имеет смысла. Такая ситуация возможна, когда статус ЕГАИС
	// "Подтвержден" был установлен вручную.
	Если Не МаркиСоответствуютАлкогольнойПродукцииТТН Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	КлючевыеПоля = "АлкогольнаяПродукция, Справка2, Номенклатура, Серия";
	Товары = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТТНИсходящаяЕГАИС, "Товары").Выгрузить();
	
	ДанныеМарокУпаковок = НовыйДанныеМарокУпаковок();
	
	// Заполнить АкцизныеМарки
	Для каждого СтрокаТовары Из Товары Цикл
	
		ПараметрыПоиска = Новый Структура(КлючевыеПоля);
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТовары);
		
		НайденныеДвиженияМарок = ДанныеОтгружаемыхШтрихкодовТТН.Марки.НайтиСтроки(ПараметрыПоиска);
		
		Для каждого ЗаписьМарки Из НайденныеДвиженияМарок Цикл
			НоваяСтрокаАкцизныеМарки = ДанныеМарокУпаковок.АкцизныеМарки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаАкцизныеМарки, ЗаписьМарки, "ИдентификаторМарки, КодУпаковки");
			НоваяСтрокаАкцизныеМарки.КлючСвязи = СтрокаТовары.НомерСтроки;		
		КонецЦикла;
	КонецЦикла;
	
	// Заполнить Упаковки
	КодыВышестоящихУпаковок = Новый Массив;
	
	Для каждого ЗаписьУпаковки Из ДанныеОтгружаемыхШтрихкодовТТН.Упаковки Цикл
		
		НоваяСтрокаУпаковки = ДанныеМарокУпаковок.Упаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУпаковки, ЗаписьУпаковки);
		
		Если ЗначениеЗаполнено(ЗаписьУпаковки.КодВышестоящейУпаковки)
			И КодыВышестоящихУпаковок.Найти(ЗаписьУпаковки.КодВышестоящейУпаковки) = Неопределено Тогда
			
			КодыВышестоящихУпаковок.Добавить(ЗаписьУпаковки.КодВышестоящейУпаковки);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого КодВышестоящейУпаковки Из КодыВышестоящихУпаковок Цикл
		НоваяСтрокаУпаковки = ДанныеМарокУпаковок.Упаковки.Добавить();
		НоваяСтрокаУпаковки.КодУпаковки = КодВышестоящейУпаковки;
	КонецЦикла;
	
	ДанныеМарокУпаковок.АкцизныеМарки.Сортировать("КлючСвязи, КодУпаковки");
	ДанныеМарокУпаковок.Упаковки.Сортировать("КодУпаковки, КодВышестоящейУпаковки");
	
	Колонка = ДанныеМарокУпаковок.АкцизныеМарки.Колонки.Найти("КодУпаковки");
	Колонка.Имя = "НомерКоробки";
	Колонка = ДанныеМарокУпаковок.АкцизныеМарки.Колонки.Найти("ИдентификаторМарки");
	Колонка.Имя = "КодАкцизнойМарки";
	Колонка = ДанныеМарокУпаковок.Упаковки.Колонки.Найти("КодУпаковки");
	Колонка.Имя = "Упаковка";
	Колонка = ДанныеМарокУпаковок.Упаковки.Колонки.Найти("КодВышестоящейУпаковки");
	Колонка.Имя = "ИерархияУпаковки";
	
	Возврат ДанныеМарокУпаковок;
	
КонецФункции

Функция НовыйДанныеМарокУпаковок()

	// АкцизныеМарки
	АкцизныеМарки = Новый ТаблицаЗначений;
	
	АкцизныеМарки.Колонки.Добавить(
		"ИдентификаторМарки",
		Метаданные.РегистрыСведений.бг_ИдентификаторыМарок.Ресурсы.ИдентификаторМарки.Тип);
		
	АкцизныеМарки.Колонки.Добавить(
		"КодУпаковки",
		Метаданные.РегистрыСведений.бг_ДвижениеМарок.Ресурсы.КодУпаковки.Тип);
		
	АкцизныеМарки.Колонки.Добавить(
		"КлючСвязи",
		Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
		
	// Упаковки
	Упаковки = Новый ТаблицаЗначений;
	
	Упаковки.Колонки.Добавить(
		"КодУпаковки",
		Метаданные.РегистрыСведений.бг_СоставУпаковок.Измерения.КодУпаковки.Тип);
		
	Упаковки.Колонки.Добавить(
		"КодВышестоящейУпаковки",
		Метаданные.РегистрыСведений.бг_СоставУпаковок.Ресурсы.КодВышестоящейУпаковки.Тип);

	ДанныеМарокУпаковок = Новый Структура;
	ДанныеМарокУпаковок.Вставить("АкцизныеМарки", АкцизныеМарки);
	ДанныеМарокУпаковок.Вставить("Упаковки", Упаковки);
	
	Возврат ДанныеМарокУпаковок;
		
КонецФункции

Функция ТТНИсходящаяОтмененаВЕГАИС(ТТНИсходящаяЕГАИС)
	
	СостояниеТТНИсходящаяЕГАИС = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ТТНИсходящаяЕГАИС);	
	СтатусыОтменыЕГАИС = Документы.ТТНИсходящаяЕГАИС.бг_СтатусыОтменыЕГАИС();
	
	ОтмененВЕГАИС = СтатусыОтменыЕГАИС.Найти(СостояниеТТНИсходящаяЕГАИС.Статус) <> Неопределено;
	
	Возврат ОтмененВЕГАИС;
	
КонецФункции

Функция СтатусТТН(Документ)
	
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ДанныеСтатуса = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Документ);	
	
	СтатусТТН = Новый Структура(
		"ЗначениеПеречисления",
		адаптер_РаботаСДаннымиИБ.ПеречислениеВСтроку(ДанныеСтатуса.Статус));
	
	Возврат СтатусТТН;
	
КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
